# 2) თქვენი სიტყვებით ახსენით რა არის for ციკლი, საიტერაციო ცვლადი, კოდის ბლოკი, როგორ მუშაობს ისინი
# for ციკლი არის მაგალითად რომ უნდა გავიმეოროთ რაღაცა ნებისმიერი რამ

# 3) შექმენით for ციკლი, რომელიც 10-დან 30-მდე რიცხვებს დაბეჭდავს
for i in range(11,30):
    print("i")

# 4) შექმენით for ციკლი, რომელიც 20-დან 40-ის ჩათვლით რიცხვებს დაბეჭდავს
for i in range(21,40):
    print("i")

# 5) შექმენით for ციკლი, რომელიც 50-დან 60-ის ჩათვლით ლუწ რიცხვებს დაბეჭდავს
for i in range(51,60):
    print("i")

# 6) შექმენით for ციკლი, რომელიც 10-დან 50-მდე კენტ რიცხვებს დაბეჭდავს
for i in range(11,50):
    print("i")

# 8) შექმენით for ციკლი, რომელიც 2-დან 30-მდე ლუწი რიცხვების ჯამს დაბეჭდავს
for i in range(3,30):
    print(i)

# 
for i in range(11, 30):
    print(i)