# <!-- 2) გამეორების მიზნით ახსენით რა არის ცვლადი, ცვლადის სახელი და ცვლადის მნიშვნელობა. ვინც ამაზე paint-ში ნახაზსაც გააკეთებს, მივანიჭებ ჯგუფის საუკეთესო მოსწავლის როლს -->
# <!-- ცვლადი პროგრამირებაში არის მეხსიერების ელემენტი, რომელსაც აქვს სახელი და გამოიყენება ინფორმაციის შესანახად, რომლითაც პროგრამის სხვადასხვა ნაწილში შეგვიძლია ვისარგებლოთ. -->


# <!-- 3) შემდეგ მათემატიკურ ოპერაციებზე ჩამოწერეთ 10-10 მაგალითი, გამოიყენეთ ცვლადები: +, -, *, / -->

# +
a = 10
b = 20
print(a + b)         # 30
print(a + 5)         # 15
print(b + 10)        # 30
print(a + b + 5)     # 35
print(a + a)         # 20
print(b + b)         # 40
print(a + 100)       # 110
print(b + 50)        # 70
print(a + b + 1)     # 31
print(b + 5)         # 25


# -
a = 30
b = 15
print(a - b)         # 15
print(a - 5)         # 25
print(b - 10)        # 5
print(a - b - 5)     # 10
print(a - a)         # 0
print(b - b)         # 0
print(a - 100)       # -70
print(b - 5)         # 10
print(a - b - 1)     # 14
print(a - 10)        # 20


# *

a = 6
b = 4
print(a * b)         # 24
print(a * 5)         # 30
print(b * 10)        # 40
print(a * b * 2)     # 48
print(a * a)         # 36
print(b * b)         # 16
print(a * 100)       # 600
print(b * 5)         # 20
print(a * b * 1)     # 24
print(b * 3)         # 12


# /
a = 50
b = 5
print(a / b)         # 10.0
print(a / 2)         # 25.0
print(b / 5)         # 1.0
print(a / b / 2)     # 5.0
print(a / a)         # 1.0
print(b / b)         # 1.0
print(a / 10)        # 5.0
print(b / 2)         # 2.5
print(a / b / 1)     # 10.0
print(a / 25)        # 2.0




# <!-- 4) ახსენით რომელია სწორი: კოდის გაშვება ზემოდან ქვემოთ ხდება თუ ქვემოდან ზემოთ -->
# სწორია ზემოდან ქვემოთ


# <!-- 5) თქვენი სიტყვებით ახსენით, პითონში მონაცემები რამდენ ნაწილად იყოფა, თითოეული როდის გვხვდება და სად ვიყენებთ. ასევე გააკეთეთ paint-ში ნახაზი ამ ინფორმაციის შესახებ (მე როგორც ვხაზავ, შეგიძლიათ მსგავსად დახაზოთ) -->


# <!-- 6) შექმენით თქვენი ოჯახის წევრების ასაკებისგან ცვლადები,
#  დააფდეითეთ მათი მნიშვნელობები ახალ ცვლადებში - დაუწერეთ 20 წლის შემდეგ რა იქნება და დაპრინტეთ ახალი ცვლადების მნიშვნელობები -->
