// 2) გამოიყენეთ ls მიმდინარე დირექტორიაში არსებული ფაილების დეტალებით (ნებართვები, მფლობელი, ზომა და ა.შ.) საჩვენებლად.

// 3) ტერმინალის გასასუფთავებლად გაუშვით ძირითადი clear ბრძანება.

// 4) clear-ის აკრეფის ნაცვლად, იგივე ეფექტის მისაღწევად დააჭირეთ Ctrl+L-ს.

// 5) გამოიყენეთ cd არგუმენტების გარეშე, რათა პირდაპირ თქვენს საწყის დირექტორიაში გადახვიდეთ.

// 6) გადადით თქვენს საწყის დირექტორიაში Documents საქაღალდეში.

// 7) გამოიყენეთ cd .. დირექტორიების ხეში ერთი დონით ზემოთ გადასასვლელად.

// 8) შექმენით app.js ფაილი მარტივი console.log("Hello Node");-ით და გაუშვით node ბრძანებით.

// 9) გამოიყენეთ ბრძანება დაინსტალირებული Node.js ვერსიის საჩვენებლად.

// 10) შექმენით დირექტორია projects სახელწოდებით cmd ბრძანების გამოყენებით.

// 11) შექმენით ფაილი test.txt და შემდეგ წაშალეთ იგი cmd ბრძანების გამოყენებით.