# 2) თქვენი სიტყვებით ახსენით რა არის , რამდენი ნაკადი გვაქვს და თითოეულისთვის რა ბრძანებას ვიყენებთ პითონში
# input არის როცა მომხმარებელს შემოაქვს ინფორმაცია, output არის როცა კომპიუტერს გამოაქვს რაიმე ინფორმცაია და გვაქვს 3 ნაკადი: input, output and error



# 4) მომხმარებელს შემოატანინეთ სახელი და გვარი, შეინახეთ ისინი ცვლადებში. შემდეგ დაუბეჭდეთ: "გამარჯობა {სახელი აქ} {გვარი აქ}."

name = input('Enter your name: ')
last_name = input('enter your lastname: ')
print('Hello ' + name + ' ' + last_name)