# 3) თქვენი სიტყვებით ახსენით როგორ მუშაობს მეტია ან ტოლია (>=), ნაკლებია ან ტოლია (<=)
# მეტია და ტოლია არის მაგალითად ცვლადებში რაც გაქვს შნახული იმას მიუთითო მაგალითად print(num 1 <= num 2) იგივეა ნაკლებლობაზე ან ტოლიაზე.

# 4) თქვენი სიტყვებით ახსენით როგორ მუშაობს პირობითი განცხადებები. გააკეთეთ მარტივი flowchart (ბლოკ-სქემა) რამე მაგალითზე
# როცა დაწრთ პირობით განცხადებას მაშინ თუ არასწორი გექნებათ კოდში დაწერილი მაშინ გამოგიტანთ იმას რაც პირობით განცხადებაში გიწერიათ იმას გამოგიგდებთ.

# 6) მომხმარებელს შემოატანინე რიცხვი და შეინახე მთელი რიცხვის სახით.

# თუ ეს რიცხვი მეტია 100-ზე, დაბეჭდე "big number",
# სხვა შემთხვევაში დაბეჭდე "small number"
user_number = int(input("Enter your number: "))
if user_number > 10:
    print("Bigger than 100")
else:
    print("Smaller than 100")