# 2) თქვენი სიტყვებით ახსენით რა არის ალგორითმი
# ალგორითმი არის მათემატიკური 4 რაღაცა:
# 1)გეგმის შედგენა
# 2)აუცილებელი საგნების ჩამოწერა
# 3)დროის განაწილება თითოეულ საგანზე
# 4)შესასრულებელი დავალებების განრიგის შედგენა



# 3 ფაინტში გავაკეთე



# 4) თქვენი სიტყვებით ახსენით რა არის range ბრძანება და როგორ მუშაობს სხვადასხვა შემთხვევებში (გადაეცემა 1, 2 ან 3 რიცხვი

# Python-ში range() ბრძანება გამოიყენება რიცხვების სერიის შესაქმნელად. მისი ძირითადი დანიშნულებაა, დააბრუნოს რიგითი რიცხვების
#  განმეორებადი ობიექტი (iterator), რომელიც ხშირად გამოიყენება for ციკლთან ერთად.

# მაგალითად: 
for i in range(10):
    print(i)

