# საკლასო დავალება: შექმენით ფუნქცია, რომლის სახელი იქნება greet. ფუნქციას გაუწერეთ 1 პარამეტრი, სახელად name. 

# ფუნქციის დავალებაა, რომ დაბეჭდოს ასეთი წინადადება "გამარჯობა {ამ ადგილას დაწეროს ის ინფორმაცია, რაც name პარამეტრში ინახება}!"

# ფუნქცია გამოიძახეთ ხუთჯერ, თითოეულ გამოძახებაზე გაუწერეთ განსხვავებული სახელი, ანუ განსხვავებული არგუმენტი
def greet(name):
    print(f"გამარჯობა {name}!")

greet("ალექსანდრე")
greet("გიორგი")
greet("დათო")
greet("ლევანი")
greet("ნინო")

# საკლასო დავალება:  

# შექმენით ფუნქცია სახელად multiply, რომელსაც ექნება 2 პარამეტრი - num1 და num2.

# ფუნქციის დავალებაა რომ დაბეჭდოს პირველი რიცხვი გამრავლებული მეორე - ანუ ამ ორი რიცხვის ნამრავლი.

# ფუნქცია გამოიძახეთ 5-ჯერ, გადაეცით სხვასხვა არგუმენტები
def multiply(num1, num2):
 
    print(num1 * num2)

multiply(3, 4)
multiply(7, 2)
multiply(10, 5)
multiply(6, 8)
multiply(9, 3)

# საკლასო დავალება:

# შექმენით ფუნქცია სახელად my_range. ამ ფუნქციას გაუწერეთ 2 პარამეტრი - num1 და num2

# ფუნქციის დავალებაა, რომ შექმნას დიაპაზონი num1-დან num2-ის ჩათვლით. შემდეგ დაბეჭდოს ამ დიაპაზონის თითოეული რიცხვი.

# ფუნქცია გამოიძახეთ 5-ჯერ, განსხვავებული არგუმენტებით
def my_range(num1, num2):
    for i in range(num1, num2 + 1):
        print(i)

my_range(1, 5)
print('---')
my_range(10, 15)
print('---')
my_range(20, 25)
print('---')
my_range(30, 35)
print('---')
my_range(40, 45)
