// საკლასო დავალება:

// components ფოლდერში დაამატეთ ორი ფოლდერი:  container, presentational.

// ორივე ფოლდერში შექმენით ერთი კომპონენტი.

// container კომპონენტში, შეადგინეთ count მდგომარეობა, რომელსაც თავიდან 0-ს გაუტოლებთ. ამ კომპონენტშივე შეადგინეთ decrease ფუნქცია, რომელიც count-ს ერთით შეამცირებს.

// container კომპონენტში დააიმპორტეთ თქვენი presentational კომპონენტი, დააბრუნეთ ის და გადაეცით ორი props: count, decrease.

// presentational კომპონენტში აიღეთ პარაგრაფი, რომელსაც ტექსტი ექნება count-ის მნიშვნელობა და ღილაკი, რომელზე დაკლიკებისას უბრალოდ გაეშვება decrease ფუნქცია.

// app-ში დააიმპორტეთ container კომპონენტი და ნახეთ თქვენი კოდის შედეგი ბრაუზერში.
