// 1)შექმენით 5 ელემენტიანი სია და შეამოწმეთ ყველა რიცხვი თუ არის კენტი რიცხვი, გამოიყენეთ .every() მეთოდი


// 2)ახსენით კომენტარებით რა არის every() მეთოდი

// პირველი კენტების ხუთცალიან სიას ვაკეთებ
const nums = [3, 5, 7, 9, 11];

// ვამოწმებ ყველა რიცხვი კენტია თუ არა
const numodd = numbers.every(num => num % 2 !== 0);

 console.log(numodd);// აქ ახლა გამოიტანს true-ს 

//  4) შექმენით სია რომელიც შედგება რიცხვებისგან შემდეგ გაფილტრეთ ლუწი და კენტი რიცხვები ერთმანეთისგან .filter() მეთოდი

// 5)შექმენით სია რომელიც შეგდება სახელებისგან შემდეგ კი find() მეთოდის საშუალებით იპოვე ის ელემენტი რომელიც შედგება 4 სიმბოლოსგან

// 6) ახსენით რას აკეთებს filter() და find() მეთოდები


// FILTER
// ვქმნი სიას(რიცხვების სიას 1-10)
const numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// ვფილტრავთ ლუწ რიცხვებს 
const evenNumbers = numbers.filter(num => num % 2 === 0);

// ვფილტრავთ კენტ რიცხვებს
const oddNumbers = numbers.filter(num => num % 2 !== 0);

console.log("ლუწი რიცხვები:", evenNumbers); //აქ გამოგვიტანს 2, 4, 6, 8, 10
console.log("კენტი რიცხვები:", oddNumbers); // აქ გამოგვიტანს 1, 3, 5, 7, 9


// FIND
// ვქმნით სახელების სიას
const names = ["Ana", "Giorgi", "Luka", "Nino", "Dato", "Mari"];

// აქ ვპოულობ ისეთ სახელებს რომლებიც ოთხ ასოიანია
const Letter4Name = names.find(name => name.length === 4);

console.log("სახელი 4 ასოთი:", Letter4Name); 
