# საკლასო დავალება:

# შექმენით dictionary, სადაც შეინახვთ შემდეგ ინფორმაციას: თქვენი სახელი, გვარი, ასაკი, საყვარელი ფერი, საცხოვრებელი ადგილი და hobbies. 

# დაბეჭდეთ ჯერ ყველა გასაღები, შემდეგ ყველა მნიშვნელობა და ბოლოს ყველა წყვილის
my_info = {
    "სახელი": "ალქსანდრე",
    "გვარი": "მახარაძე",
    "ასაკი": "9",
    "საყვარელი ფერი": "შავი",
    "საცხოვრებელი ადგილი": "სიმონ ჩიქოვანი 4",
    "ჰობი": ["კოდის წერა", "მუსიკების მოსმენა", "ტელევიზორზე ყურება"]
}

print(my_info())
# საკლასო დავალება:
# Create a list comprehension that generates a list of numbers from 1 to 50 that are divisible by 3.
numbers_divisible_by_3 = [number for number in range(1, 51) if number % 3 == 0]